{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "Idefics3ForConditionalGeneration",
    "parent_library": "transformers.models.idefics3.modeling_idefics3"
  },
  "base_model_name_or_path": "HuggingFaceTB/SmolVLM-256M-Instruct",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": "gaussian",
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "k_proj",
    "gate_proj",
    "o_proj",
    "down_proj",
    "q_proj",
    "v_proj",
    "up_proj"
  ],
  "task_type": null
}